Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АкцизныйНалог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитическаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитическиеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безнадбавочный</Name>
					<Comment>На товар не распространяются никакие надбавки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безскидочный</Name>
					<Comment>На товар не распространяются ни какие скидки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСравнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Comment>Весовой товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Временной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаБлюда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыБлюд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заменяемый</Name>
					<Comment>Товар заменяется в чеке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяКомплектами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяМодификаторами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяТоварами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяУсловиями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЕдиницыИзмеренияДляОтчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоМодификаторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миниатюра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеВремяЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественныйВыборМодификаторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модифицируемый</Name>
					<Comment>Блюдо имеет неотъемлемый модификатор</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Набор</Name>
					<Comment>Набор товаров и блюд</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Comment>Краткое наименование, для ККМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Принтер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПенсионныйФонд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Печатаемый</Name>
					<Comment>Печать товара в пречеке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторениеМодификаторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Связана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС для данного товара</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Все виды услуг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточняемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлИзображения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценовой</Name>
					<Comment>Товар имеющий цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штучный</Name>
					<Comment>Штучный товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПравилаИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПравилаИспользования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравилИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаНераспределеннойНоменклатуры/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидМенюПриИзменении(Элемент)
	
	ВидМенюПриИзмененииСервер();
	
КонецПроцедуры // ВидМенюПриИзменении()

&НаСервере
Процедура ВидМенюПриИзмененииСервер()
	
	// Принудительный сброс строки и родителя (иначе плотформа может повести себя неадекватно).
	Элементы.Меню.ТекущаяСтрока = Неопределено;
	Элементы.Меню.ТекущийРодитель = Неопределено;
	
	Меню.Параметры.УстановитьЗначениеПараметра("ВидМеню", ВидМеню);
	
КонецПроцедуры // ВидМенюПриИзменении()

&НаКлиенте
Процедура РесторанПриИзменении(Элемент)
	
	РесторанПриИзмененииСервер();
	
КонецПроцедуры // ВидМенюПриИзменении()

&НаСервере
Процедура РесторанПриИзмененииСервер()
	
	// Принудительный сброс строки и родителя (иначе плотформа может повести себя неадекватно).
	Элементы.РабочиеЦентрыНоменклатура.ТекущаяСтрока = Неопределено;
	Элементы.РабочиеЦентрыНоменклатура.ТекущийРодитель = Неопределено;
	
	// Рабочие центры.
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КОЛИЧЕСТВО(РабочиеЦентры.Ссылка) КАК Количество
	                      |ИЗ
	                      |	Справочник.РабочиеЦентры КАК РабочиеЦентры
	                      |ГДЕ
	                      |	РабочиеЦентры.Актуальность
	                      |	И РабочиеЦентры.Владелец = &Ресторан");
	Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоРабочихЦентров = Выборка.Количество;
	Иначе
		КоличествоРабочихЦентров = 0;
	КонецЕсли; 
	
	// Номенклатура.
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	СправочникНоменклатура.Ссылка КАК Номенклатура
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК СправочникНоменклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ПравилаИспользованияНоменклатуры.ОбъектИспользования КАК Номенклатура
	                      |		ИЗ
	                      |			РегистрСведений.ПравилаИспользования КАК ПравилаИспользованияНоменклатуры
	                      |		ГДЕ
	                      |			ПравилаИспользованияНоменклатуры.ОбъектИспользования ССЫЛКА Справочник.Номенклатура
	                      |			И ПравилаИспользованияНоменклатуры.ВладелецПравилИспользования ССЫЛКА Справочник.РабочиеЦентры
	                      |			И ПравилаИспользованияНоменклатуры.ВладелецПравилИспользования.Актуальность
	                      |			И ПравилаИспользованияНоменклатуры.ВладелецПравилИспользования.Владелец = &Ресторан
	                      |			И НЕ ПравилаИспользованияНоменклатуры.Актуальность
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ПравилаИспользованияНоменклатуры.ОбъектИспользования
	                      |		
	                      |		ИМЕЮЩИЕ
	                      |			КОЛИЧЕСТВО(ПравилаИспользованияНоменклатуры.ВладелецПравилИспользования) = &КоличествоРабочихЦентров) КАК ВыборкаНоменклатуры
	                      |		ПО СправочникНоменклатура.Ссылка = ВыборкаНоменклатуры.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ПравилаИспользованияНоменклатурныхГрупп.ОбъектИспользования КАК НоменклатурнаяГруппа
	                      |		ИЗ
	                      |			РегистрСведений.ПравилаИспользования КАК ПравилаИспользованияНоменклатурныхГрупп
	                      |		ГДЕ
	                      |			ПравилаИспользованияНоменклатурныхГрупп.ОбъектИспользования ССЫЛКА Справочник.НоменклатурныеГруппы
	                      |			И ПравилаИспользованияНоменклатурныхГрупп.ВладелецПравилИспользования ССЫЛКА Справочник.РабочиеЦентры
	                      |			И ПравилаИспользованияНоменклатурныхГрупп.ВладелецПравилИспользования.Актуальность
	                      |			И ПравилаИспользованияНоменклатурныхГрупп.ВладелецПравилИспользования.Владелец = &Ресторан
	                      |			И НЕ ПравилаИспользованияНоменклатурныхГрупп.Актуальность
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ПравилаИспользованияНоменклатурныхГрупп.ОбъектИспользования
	                      |		
	                      |		ИМЕЮЩИЕ
	                      |			КОЛИЧЕСТВО(ПравилаИспользованияНоменклатурныхГрупп.ВладелецПравилИспользования) = &КоличествоРабочихЦентров) КАК ВыборкаНоменклатурныеГруппы
	                      |		ПО СправочникНоменклатура.НоменклатурнаяГруппа = ВыборкаНоменклатурныеГруппы.НоменклатурнаяГруппа
	                      |ГДЕ
	                      |	НЕ &Ресторан = ЗНАЧЕНИЕ(Справочник.Рестораны.ПустаяСсылка)
	                      |	И (&КоличествоРабочихЦентров = 0
	                      |			ИЛИ НЕ ВыборкаНоменклатуры.Номенклатура ЕСТЬ NULL 
	                      |			ИЛИ НЕ ВыборкаНоменклатурныеГруппы.НоменклатурнаяГруппа ЕСТЬ NULL )
	                      |	И НЕ СправочникНоменклатура.ЭтоГруппа");
	Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Запрос.УстановитьПараметр("КоличествоРабочихЦентров", КоличествоРабочихЦентров);
	
	// Параметры.
	РабочиеЦентрыНоменклатура.Параметры.УстановитьЗначениеПараметра("Номенклатура", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	РабочиеЦентрыНоменклатурныеГруппы.Параметры.УстановитьЗначениеПараметра("Ресторан", Ресторан);
	РабочиеЦентрыНоменклатурныеГруппы.Параметры.УстановитьЗначениеПараметра("КоличествоРабочихЦентров", КоличествоРабочихЦентров);
	
КонецПроцедуры // ВидМенюПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Владельцы.
	ВидМеню = Справочники.ВидыМеню.ОсновнойВидМеню();
	Ресторан = Справочники.Рестораны.ОсновнойРесторан();
	
	// Параметры.
	ВидМенюПриИзмененииСервер();
	РесторанПриИзмененииСервер();
	
	// Настройка формы.
	Элементы.РабочиеЦентрыНоменклатурныеГруппыГруппа.Видимость = ПолучитьФункциональнуюОпцию("РежимНастройкиРабочихЦентровНоменклатурныеГруппы"); 
	Элементы.РабочиеЦентрыНоменклатураГруппа.Видимость = ПолучитьФункциональнуюОпцию("РежимНастройкиРабочихЦентровНоменклатура"); 
	Если Элементы.РабочиеЦентрыНоменклатурныеГруппыГруппа.Видимость Тогда
		Если Не Элементы.РабочиеЦентрыНоменклатураГруппа.Видимость Тогда
			Элементы.РабочиеЦентрыНоменклатурныеГруппы.РастягиватьПоВертикали = Истина;
		КонецЕсли; 
	Иначе
		Если Не Элементы.РабочиеЦентрыНоменклатураГруппа.Видимость Тогда
			Элементы.РабочиеЦентрыНоменклатурныеГруппыГруппа.Видимость = Истина;
			Элементы.РабочиеЦентрыНоменклатураГруппа.Видимость = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если __УправлениеДаннымиКлиентСервер.ОповещениеИзмененияРаспределениеНоменклатуры(ИмяСобытия) Тогда
		Элементы[Параметр].Обновить();
	КонецЕсли;
	Если __УправлениеДаннымиКлиентСервер.ОповещениеИзмененияНастроекРабочихЦентров(ИмяСобытия) Тогда
		РесторанПриИзмененииСервер();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()
